// 1. С помощью цикла while вывести все простые числа в промежутке от 0 до 100.
var i = 2
while (i < 101) {
    if (i % 2 != 0 && i % 3 != 0 && i % 5 != 0 && i % 7 != 0 || i == 2 || i == 3 || i == 5 || i == 7)
        console.log(i)
    i++
}
// 2. С этого урока начинаем работать с функционалом интернет-магазина. Предположим, есть сущность корзины.
// Нужно реализовать функционал подсчета стоимости корзины в зависимости от находящихся в ней товаров. Товары в корзине хранятся в массиве. Задачи:
// a) Организовать такой массив для хранения товаров в корзине;
// b) Организовать функцию countBasketPrice, которая будет считать стоимость корзины.
var arr = [
    ["Процессор", 5000],
    ["Видеокарта", 20000],
    ["ОП", 10000]
]

function countBasketPrice(arr) {
    let result = 0
    for (let element of arr) {
        result = element[1] + result
    }
    return (result)
}

countBasketPrice(arr)

// 3. *Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть это должно так:
// for(…){// здесь пусто}

// 4. *Нарисовать пирамиду с помощью console.log, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:
// x
// xx
// xxx
// xxxx
// xxxxx
var result = ''
while (result.length < 20) {
    result = result + "x"
    if (true)
        console.log(result)
}
